"use client"
import styles from './price.module.css';
import PriceItem from '@/components/Price/PriceItem/PriceItem';

const price = [
    {
        icon: 'price-1', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        icon: 'price-2', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        icon: 'price-3', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        icon: 'price-4', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        icon: 'price-5', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        icon: 'price-6', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        icon: 'price-7', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
            {title: 'Виклик лікаря кардіолога додому', price: 1800},
        ]
    },
    {
        title: 'Довірте своє здоров\'я експертам GENIUS\u00a0health\u00a0clinic',
    },
];

export default function Price() {
    return (
        <div className={styles.price}>
            <div className={styles.container}>
                <div className={styles.titleWrapper}>
                    <h2 className={styles.title}>Ціни на послуги</h2>
                </div>
            </div>
            <div className={styles.bg}>
                <div className={styles.container}>
                    {
                        price.map((item, index) => (
                            <PriceItem item={item} key={index} />
                        ))
                    }
                </div>
            </div>
        </div>
    )
}