"use client"
import styles from './price.module.css';
import PriceItem from '@/components/Price/PriceItem/PriceItem';

const price = [
    {
        icon: 'price-1', title: 'Виклик лікаря на дім або офіс', text: 'м. Київ та Київська обл. (30 км)',
        list: [
            {title: 'Виклик кардіолога додому', price: 1800},
            {title: 'Виклик кардіолога у вечірній час, вихідні та святкові дні', price: 2400},
            {title: 'Виклик терапевта в офіс на 1 годину', price: 1400},
            {title: 'Виклик терапевта додому до хворого на COVID-19', price: 1200},
            {title: 'Виклик педіатра', price: 1200},
            {title: 'Виклик терапевта', price: 1200},
            {title: 'Виїзд лікаря в Київську обл. оплачується додатково в залежності від населеного пункту'},
        ]
    },
    {
        icon: 'price-2', title: 'Телемедицина (онлайн)', text: 'Консультація по телефону чи в месенджерах',
        offer: 'Знижки до 50%!', offerValue: '0.5',
        list: [
            {title: 'Консультація терапевта', price: 350, fixedPrice: true,},
            {title: 'Консультація гастроентеролога', price: 600},
            {title: 'Консультація педіатра', price: 600},
            {title: 'Консультація неонатолога', price: 600},
            {title: 'Консультація дерматолога', price: 600},
            {title: 'Консультація кардіолога', price: 600},
            {title: 'Консультація ЛОРа', price: 600},
            {title: 'Консультація невропатолога', price: 600},
            {title: 'Консультація уролога', price: 600},
            {title: 'Консультація ортопеда-травматолога', price: 700, fixedPrice: true,},
            {title: 'Консультація гінеколога', price: 600},
            {title: 'Консультація психолога', price: 700, fixedPrice: true,},
            {title: 'Консультація ендокринолога', price: 600},
        ]
    },
    {
        icon: 'price-3', title: 'Консультація (очна)', text: 'Консультація в клініці',
        list: [
            {title: 'Консультація сімейного лікаря', price: 600},
            {title: 'Консультація гастроентеролога', price: 600},
            {title: 'Консультація ендокринолога', price: 600},
            {title: 'Консультація педіатра', price: 600},
            {title: 'Консультація ортопеда-травматолога', price: 700},
            {title: 'Консультація кардіолога', price: 600},
            {title: 'Консультація невропатолога (дитячий/дорослий)', price: 600},
            {title: 'Консультація косметолога', price: 300},
            {title: 'Консультація дерматолога', price: 600},
            {title: 'Консультація психолога', price: 1200},
        ]
    },
    {
        icon: 'price-4', title: 'Лабораторні дослідження', text: 'Лабораторні дослідження (швидкі)',
        list: [
            {title: 'Коронавірус SARS-CoV-2 (COVID19) + Тест на антиген грипу А+В (швидкий)', price: 960},
            {title: 'Коронавірус SARS-CoV-2 (COVID19) (швидкий)', price: 720},
            {title: 'Тест на антиген грипу А+В (швидкий)', price: 960},
        ]
    },
    {
        icon: 'price-5', title: 'Фізіотерапія', text: 'Масаж, фонофорез, електрофорез, ударно-хвильова терапія, магнітотерапія',
        offer: 'Знижки до 20%!', offerValue: '0.8',
        list: [
            {title: 'Лікувальний масаж верхньої кінцівки (2 кінцівки)', price: 360},
            {title: 'Лікувальний масаж голови (лобно-скроневої та потилично-тім\'яної області)', price: 480},
            {title: 'Лікувальний масаж голови та шиї', price: 540},
            {title: 'Лікувальний масаж грудної клітини (дренажний)', price: 540},
            {title: 'Лікувальний масаж живота', price: 290},
            {title: 'Лікувальний масаж нижньої кінцівки (2 кінцівки)', price: 650},
            {title: 'Лікувальний масаж попереково-крижового відділу хребта', price: 480},
            {title: 'Лікувальний масаж спини загальний', price: 870},
            {title: 'Лікувальний масаж хребта (паравертебральний)', price: 720},
            {title: 'Лікувальний масаж шийно-грудного відділу хребта', price: 650},
            {title: 'Лікувальний масаж шийно-комірцевої області', price: 650},
            {title: 'Профілактичний масаж загальний (спина, ноги, живіт, груди, руки, голова)', price: 1150},
            {title: 'Релакс масаж тіла', price: 1600},
            {title: 'Фонофорез (без препарату)', price: 250, fixedPrice: true},
            {title: 'Електрофорез (без препарату)', price: 250, fixedPrice: true},
            {title: 'Ударно-хвильова терапія (одна процедура)', price: 900, fixedPrice: true},
            {title: 'Магнітотерапія', price: 500, fixedPrice: true},
        ]
    },
    {
        icon: 'price-7', title: 'Інструментальні дослідження', text: 'Неінвазивні методи дослідження',
        list: [
            {title: 'Електрокардіограма (ЕКГ)', price: 300},
            {title: 'ЕКГ з розшифровкою', price: 360},
            {title: 'УЗД колінного, плечового, ліктьового, променево-зап\'ясткового, гомілковостопного суглоба', price: 660},
            {title: 'УЗД черевної порожнини', price: 750},
            {title: 'УЗД нирок', price: 600},
            {title: 'УЗД щитоподібної залози', price: 650},
            {title: 'УЗД молочних залоз', price: 650},
            {title: 'УЗД органів малого тазу', price: 600},
        ]
    },
    {
        icon: 'price-10', title: 'Косметологія', text: 'Ботулінотерапія, контурна пластика обличчя, аугментація губ, плазмотерапія, мезотерапія, корекція вікових змін.',
        list: [
            { title: "Ботулінотерапія лоб + міжбрів'я Neuronox", price: 4000 },
            { title: "Ботулінотерапія лоб + міжбрів'я Botox", price: 4700 },
            { title: "Ботулінотерапія лоб + міжбрів'я Диспорт", price: 5000 },
            { title: "Ботулінотерапія міжбрів'я Neuronox", price: 2000 },
            { title: "Ботулінотерапія міжбрів'я Botox", price: 2500 },
            { title: "Ботулінотерапія міжбрів'я Диспорт", price: 2700 },
            { title: "Ботулінотерапія навколо очей (гусині лапки) Neuronox", price: 2000 },
            { title: "Ботулінотерапія навколо очей (гусині лапки) Botox", price: 2500 },
            { title: "Ботулінотерапія навколо очей (гусині лапки) Диспорт", price: 2700 },
            { title: "Ботулінотерапія лоб + міжбрів'я + очі Neuronox", price: 5500 },
            { title: "Ботулінотерапія лоб + міжбрів'я + очі Botox", price: 7000 },
            { title: "Ботулінотерапія лоб + міжбрів'я + очі Диспорт", price: 7500 },
            { title: "Ботулінотерапія ролячі зморшки Neuronox", price: 500 },
            { title: "Ботулінотерапія ролячі зморшки Botox", price: 1000 },
            { title: "Ботулінотерапія ролячі зморшки Диспорт", price: 2000 },
            { title: "Ботулінотерапія ясенева посмішка", price: 1200 },
            { title: "Гіпергідроз жінки Neuronox", price: 7000 },
            { title: "Гіпергідроз жінки Botox", price: 8500 },
            { title: "Гіпергідроз жінки Диспорт", price: 12000 },
            { title: "Гіпергідроз чоловіки Neuronox", price: 11000 },
            { title: "Гіпергідроз чоловіки Botox", price: 13000 },
            { title: "Гіпергідроз чоловіки Диспорт", price: 15000 },
            { title: "Біоревіталізація Rejuran S 1 ml (рубці, постакне)", price: 3500 },
            { title: "Біоревіталізація Rejuran HB plus 1 ml", price: 4000 },
            { title: "Біоревіталізація Rejuran Healer 2 ml", price: 5000 },
            { title: "Біоревіталізація Rejuran I (очі) 1 ml", price: 3500 },
            { title: "Біоревіталізація Plinest eye 2 ml", price: 4500 },
            { title: "Біоревіталізація Kiara 2.2 ml", price: 2200 },
            { title: "Контурна пластика обличчя Stylage L 1ml", price: 4500 },
            { title: "Контурна пластика обличчя Saupha volum 1 ml", price: 4200 },
            { title: "Контурна пластика обличчя Juvederm ultra 4 1 ml", price: 5700 },
            { title: "Контурна пластика обличчя Neuramis volum 1 ml", price: 4000 },
            { title: "Поверхневий фруктовий пілінг по типу шкіри", price: 1000 },
            { title: "Пілінг зони навколо очей", price: 700 },
            { title: "Ретиноловий пілінг (серединний)", price: 1500 },
            { title: "Пілінг BioRePeel (біоревіталізуючий)", price: 1500 },
            { title: "Пілінг PRX-T33 (дерматостимулюючий)", price: 1800 },
            { title: "Пілінг APPeex (біоревіталізуючий)", price: 1500 },
            { title: "Контурна пластика губ Teosyal RHA kiss 0.7 ml", price: 6500 },
            { title: "Контурна пластика губ Stylage S 0.8 ml", price: 4800 },
            { title: "Контурна пластика губ Stylage M 1ml", price: 5200 },
            { title: "Контурна пластика губ Stylage L 1ml", price: 6000 },
            { title: "Контурна пластика губ Neuramis deep 1 ml", price: 4200 },
            { title: "Контурна пластика губ Saupha 1 ml", price: 5200 },
            { title: "Ліполітики Обличчя 2.5 ml", price: 1500 },
            { title: "Ліполітики Тіло 5 ml", price: 3000 },
            { title: "Карбоксітерапія", price: 1000 },
            { title: "Карбоксітерапія + пілінг", price: 1200 },
            { title: "Масаж обличчя класичний", price: 700 },
            { title: "Масаж обличчя авторський", price: 800 },
            { title: "Масаж обличчя пластичний", price: 600 },
            { title: "CASMARA Ocean miracle (Диво океану)", price: 1500 },
            { title: "CASMARA RGnerin", price: 1400 },
            { title: "CASMARA PURIFYING", price: 1200 },
            { title: "CASMARA Skin Sensation", price: 1300 },
            { title: "Комбінована чистка + пілінг + маска", price: 1500 },
            { title: "Комбінована чистка + карбоксітерапія", price: 1700 },
            { title: "Ультразвукова чистка + пілінг + маска", price: 1000 },
            { title: "Ультразвукова чистка + карбоксітерапія", price: 1600 },
            { title: "Чистка + пілінг BioRePeel", price: 2000 },
            { title: "Чистка спини + пілінг + маска", price: 2500 },
            { title: "Вакуумна чистка обличчя", price: 1200 },
            { title: "Газорідинний пілінг", price: 850 },
            { title: "Мікротоки", price: 600 }
        ]
    },
    {
        icon: 'price-6', title: 'Загальні медичні процедури', text: 'Маніпуляції загального медичного характеру',
        list: [
            { title: 'Забір крові з вени на лабораторні дослідження', price: 50 },
            { title: 'Забір біологічного матеріалу для аналізів (сечі, мокротиння, мазок із зіва та порожнини носа і т. п.)', price: 50 },
            { title: 'Внутрішньовенна інфузія 30 хв. (без вартості препарату)', price: 480 },
            { title: 'Вимирювання рівню цукру в крові', price: 130 },
            { title: 'Ін\'єкція внутрішньошкірна, підшкірна, внутрішньом\'язова, внутрішньовенна (без вартості препарату)', price: 100 },
            { title: 'Забір матеріалу на ПЛР-обстеження', price: 80 },
            { title: 'Проведення внутрішньошкірних проб', price: 100 },
            { title: 'Проведення вакцинації поза календарем профілактичних щеплень', price: 200 }
        ]
    },
    {
        icon: 'price-8', title: 'Довідки', text: 'Оформлення медичної документації',
        list: [
            { title: 'Оформлення медичної документації', price: 250 },
            { title: 'Оформлення медичної документації (Довідка в басейн)', price: 360 },
            { title: 'Оформлення медичної документації (Довідка)', price: 180 }
        ]
    },
    {
        title: 'Довірте своє здоров\'я експертам GENIUS\u00a0health\u00a0clinic',
    },
];

export default function Price() {
    return (
        <div className={styles.price} id='prices'>
            <div className={styles.container}>
                <div className={styles.titleWrapper}>
                    <h2 className={styles.title}>Ціни на послуги</h2>
                </div>
            </div>
            <div className={styles.bg}>
                <div className={styles.container}>
                    {
                        price.map((item, index) => (
                            <PriceItem item={item} key={index} />
                        ))
                    }
                </div>
            </div>
        </div>
    )
}