"use client"
import styles from './doctors.module.css';
import 'keen-slider/keen-slider.min.css';
import { useKeenSlider } from 'keen-slider/react';
import { useState } from 'react';
import Doctor from '@/components/Doctors/Doctor/Doctor';
import SliderControls from '@/components/Doctors/SliderControls';

const doctors = [
    {
        name: 'Полієнко Петро', position: 'головний лікар, кардіолог', exp: '7 років', info: 'Лікар із багаторічним досвідом роботи терапевтом і керівником медичних підрозділів; з 2024 року — завідувач кардіологічного відділення госпіталю МВС. Спеціалізується в кардіології, УЗ-діагностиці та ревматології, має великий досвід ведення пацієнтів із тяжкими та хронічними станами. Проводить сучасну діагностику й лікування, підбирає індивідуальні програми терапії та реабілітації.',
        img: 'polienko.jpg'
    },
    {
        name: 'Акулов Дмитро', position: 'сімейний лікар, педіатр', exp: '', info: 'лікар-терапевт, лікар-гастроентеролог',
        img: 'akulov.jpg'
    },
    {
        name: 'Дідок Людмила', position: 'терапевт, лікар з ультразвукової діагностики', exp: 'понад 5 років', info: 'Висококваліфікований терапевт з досвідом понад 7 років, яка спеціалізується на діагностиці та лікуванні широкого спектру захворювань внутрішніх органів. Активно використовує сучасні методи діагностики, включаючи ЕКГ, УЗД, лабораторні дослідження, що дозволяє точно визначити причину захворювання та призначити ефективне лікування.',
        img: 'didok.jpg'
    },
    {
        name: 'Мельник Лідія', position: 'невролог', exp: '', info: 'Проводить діагностику, лікування та профілактику захворювань нервової системи, зокрема головного болю, мігрені, невралгій, порушень руху, остеохондрозу, міжхребцевих гриж і нейропатій. Виконує неврологічний огляд, призначає необхідні обстеження (МРТ, КТ, ЕЕГ, ЕНМГ тощо) та підбирає індивідуальне лікування і реабілітацію, зокрема після інсультів і травм.',
        img: 'melnyk.jpg'
    },
    {
        name: 'Костишин Лілія', position: 'отоларинголог', exp: '', info: 'Приймає дорослих і дітей від 3 років, діагностує та лікує гострі й хронічні захворювання ЛОР-органів доказовими та безпечними методами. Допомагає при риніті, синуситі, тонзиліті, отиті, аденоїдних проблемах, носових кровотечах, закладеності вух і наслідках ЛОР-травм. Виконує сучасні амбулаторні процедури (промивання, маніпуляції з мигдаликами та пазухами, відновлення прохідності слухової труби, видалення пробок/сторонніх тіл), підбираючи індивідуальний план лікування.',
        img: 'kostyshyn.jpg'
    },
    {
        name: 'Шарков Олександр', position: 'масажист', exp: '', info: 'Займається відновленням та підтримкою фізичного стану за допомогою різних технік масажу. Допомагає зменшити біль, зняти напругу в м’язах, покращити кровообіг і загальний стан організму, сприяє швидшому відновленню після травм та фізичних навантажень.',
        img: 'sharkov.jpg'
    },
    {
        name: 'Коломієць Анастасія', position: 'фізичний терапевт, реабілітолог, кінезіотерапевт', exp: '5 років', info: 'Спеціалізується на відновленні рухових функцій, покращенні фізичної форми та зменшенні болю за допомогою індивідуально підібраних програм ЛФК та кінезіотерапії.\n' +
            '\n' +
            'Допомагає пацієнтам швидко відновитися після травм, операцій та хронічних захворювань опорно-рухового апарату, поєднуючи сучасні методики та науковий підхід для досягнення максимальних результатів.',
        img: 'kolomiiets.jpg'
    },
    {
        name: 'Ферас Ель-Заммар', position: 'ортопед-травматолог', exp: '', info: 'спеціалізується на лікуванні та реабілітації після травм та захворювань опорно-рухового апарату',
        img: 'feras.jpg'
    },
    {
        name: 'Плис Віталія', position: 'отоларинголог', exp: '', info: 'дитячий та дорослий отоларинголог',
        img: 'plys.jpg'
    },
    {
        name: 'Білоус Інна', position: 'косметолог', exp: '10 років', info: 'ботулінотерапія, контурна пластика обличчя, аугментація губ, плазмотерапія, мезотерапія, корекція вікових змін',
        img: 'bilous.jpg'
    },
]

export default function Doctors() {
    const [loaded, setLoaded] = useState(false)
    const [sliderRef, instanceRef] = useKeenSlider({
        initial: 0,
        created() {
            setLoaded(true)
        },
        slides: {
            perView: 5,
            spacing: 20,
        },
        loop: true,
        breakpoints: {
            '(max-width: 1250px)': {
                slides: {
                    perView: 1,
                    spacing: 10,
                },
            },
        },
    });

    return (
        <div className={styles.doctors} id='doctors'>
            <div className={styles.container}>
                <div className={styles.titleWrapper}>
                    <h2 className={styles.title}>Наші спеціалісти</h2>
                    <h3 className={styles.subtitle}>Наші лікарі – це професіонали з багаторічним досвідом, які постійно підвищують свою кваліфікацію.</h3>
                    {
                        loaded &&
                        instanceRef.current &&
                        <SliderControls instanceRef={instanceRef}/>
                    }
                </div>
                <div
                    className={`keen-slider ${styles.slider}`}
                    ref={sliderRef}
                >
                    {
                        doctors.map((doctor, index) => (
                            <Doctor item={doctor} key={index} />
                        ))
                    }
                </div>
                {
                    loaded &&
                    instanceRef.current &&
                    <div className={styles.mobileControls}>
                        <SliderControls instanceRef={instanceRef}/>
                    </div>
                }
            </div>
        </div>
    )
}